{
    "facts-game": {
        "the-anime-name": {
            "description":  "Как-то раз японец сказал мне, что моё короткое имя звучит как имя персонажа из аниме, и он подумал, что это просто такой ник. Я не растерялась в моменте и спокойно объяснила, что даже моя мама зовёт меня так с самого детства. И именно поэтому я (e)L. Приятно познакомиться!",
            "achievement": ""
        } ,
        "the-walking-dictionary": {
            "description": "В университете я была очень дотошной студенткой. На практических занятиях по переводу я всегда выписывала не только релевантные в данном контексте смыслы слова,  но и его другие интересные значения. Кажется, моих одногруппников это даже раздражало в какой-то степени и они даже прозвали меня «ходячим словарём». Вот же я была ботаником!",
            "achievement": ""
        },
        "the-tumblr-beginning": {
            "description": "В средней школе я открыла для себя Tumblr,  в котором была возможность редактировать тему своего профиля в HTML-редакторе прямо на сайте. Тогда я почти ничего не знала о кодинге, но в интернете можно было найти темы с открытым исходным кодом, которые мы брали редактировали, добавляя всякое, как кастомные курсоры! Это был мой первый опыт в веб-дизайне, и это было достаточно весело.",
            "achievement": ""
        },
        "the-fateful-advice": {
            "description": "Я окончательно решила стать фронтенд-разработчиком на курсе по профессиональной локализации игр. Я думала, что просто углублю знания о CAT-инструментах, но ведущий курса рекомендовал также пройти курс по HTML, чтобы лучше понимать его  вкрапления в документации. Я так и сделала... и вот я здесь. Меня засосало в пучину кодинга, и мне это нравится!",
            "achievement": ""
        },
        "the-diverted-path": {
            "description": "Изначально я хотела выбрать информатику для сдачи на ЕГЭ. Моя учительница по информатики прямо заявила, что не допустит меня до экзамена, потому что наш предыдущий учитель плохо нас подготовил, и если я завалю, то это скажется на ней. Я была застенчивым ребёнком и не стала возражать (хотя сейчас я понимаю, что нужно было постоять за себя). В итоге я сдавала английский и историю, что и привело меня в направление перевода (Но в конце концов я всё же вернулась к первоначальному плану!)",
            "achievement": ""
        },
        
        "the-proactive-kid": {
            "description": "В детстве я была очень активным ребёнком! Мама записывала меня на различные кружки: танцы, английский и плавание! Я почти всегда куда-то спешила, но всё равно успевала сделать все домашние задания и хорошо учиться. Жаль, что у меня не было больше времени, чтобы по-настоящему преуспеть в плавании!",
            "achievement" : ""
        },
        "the-language-environment": {
            "description": "Я слышала иностранные языки с детства. Мой родной язык — русский, но большая часть моей семьи говорит на татарском. Я выросла в Башкортостане, где мы изучали башкирский в школе. Мой первый урок английского был в пять лет. Я хотела учить японский с пятого класса и наконец начала заниматься им, в качестве хобби на первом курсе университета — в том же году, когда у нас были занятия по латыни. Моим основным языком в университете был английский, а немецкий — вторым. Изучение языков — это тяжело, но я бы хотела выучить ещё много других.",
            "achievement": ""
        },
        "learning-english-through-music": {
            "description": "Мне особо никогда не нравилась музыка на русском, она всегда было какая-то неловкая(кринжовая хд). С подросткового возраста я переключилась на английские песни, что поспособствовало моему прогрессу в языке. Я даже записывала тексты песен в блокнот, чтобы анализировать новые слова и подпевать. Это тот метод, который я всегда рекомендую людям, ищущим мотивацию для изучения языков: найдите то, что у вас вызывает интерес, и наслаждаясь процессом. Сейчас я подсела японскоую музыку!",
            "achievement": ""
        },
        "the-passionate-linguist": {
            "description": "Когда я знакомлюсь с новыми людьми, разговор часто заходит о том, что я делюсь случайными лингвистическими фактами (особенно об этимологии!), объясняю, как работает локализация. Часто поясняю людям, которые утверждают, что неологизмы «загрязняют» язык: 'ПОЗВОЛЬТЕ МНЕ ЗАЧИТАТЬ ВАМ МОЮ ДИПЛОМНУЮ РАБОТУ НА ЭТУ ТЕМУ, ГДЕ Я ИСПОЛЬЗОВАЛА GOOGLE NGRAMS И МАСС-МЕДИА РЕСУРСЫ! Просто запомните: язык — это живая структура; он всегда будет принимать новую лексику и адаптироваться к современным потребностям. носителей языка. ТОЧКА.'",
            "achievement": ""
        },
        "the-nlp-revelation": {
            "description": "В университете у нас был курс по NLP (обработка естественного языка) — области, которая связывает лингвистику с математикой и программированием и широко используется в ИИ. Мы обсуждали всё: от CAT-инструментов и n-грамм до того, как работают VPN. На третьем курсе нам нужно было использовать книгу в качестве документации для поиска в большой литературной базе данных с помощью Python. Как студенты-переводчики с нулевым опытом программирования, мы не совсем понимали, что от нас хотят, и преподователь тоже не особо мог в объяснения. Тогда это было кошмаром, на яву но сейчас я примерно понимаю, что это было и для чего, мы были просто ужасно неподготовлены.",
            "achievement": ""
        },
        "face-reveal": {
            "description": "",
            "achievement": "MET THE DEV"
        }
    },
    "game-section":{
        "congrats": "Поздравляем!",
        "hi": "Я Элина(Эл), приятно познакомиться!",
        "again": "сначала",
        "achievement-unlocked": "ДОСТИЖЕНИЕ ОТКРЫТО",
        "start": "старт",
        "pull": "открыть"

    }
}