{
    "main-tech": "Осн. инструменты: ",
    "main-pr": "Мои проекты",
    "legacy-intro": "С чего все началось? Ознакомьтесь с моими проектами, сделанными на курсах FreeCodeCamp",
    "lads-battles": {
        "title": "Love and Deepspace Battles",
        "description": "Фан-сайт по Love and Deepspace (LADS) с детальной информацией о персонажах: навыки, оружие, геймплей и т.д. Создан, чтобы помочь разобраться с боевыми механиками на нескольких языках."
    },
    "weather-app": {
        "title": "Сайт с погодой",
        "description": "Адаптивное приложение для прогноза погоды с анимированными фонами, подстраивающимися под местное время. Температура в °C/°F. Доп. функции: УФ-индекс, влажность, ощущается как, направление и скорость ветра. Доступно на 3 языках."
    },
    "html-css": {
        "description": "Простые проекты, созданные для курса FreeCodeCamp по адаптивному веб-дизайну (Responsive Web Design) в 2024 году",
        "survey-form": {
            "description" : "Самая первая веб-страница. Создана для выполнения задания «форма опроса». Использовались разные поля ввода, кнопки и свойства форм. За основу брались структура HTML и атрибуты id."
        },
        "tribute-page": {
            "description" : "Второй проект был посвящен созданию мемориальной страницы. Задание затрагивало элемент img и работу с ним, также id и, как его атрибуты помогают в оформлении."
        },
        "technical-documentation": {
            "description" : "В рамках третьего проекта нужно было создать страницу с технической документацией. Основное внимание уделялось адаптивной панели навигации и организации контента с помощью семантических разделов."
        },
        "product-landing": {
            "description" : "Четвертый проект заключался в создании лендинг страницы. Для выполнения задач использовались адаптивный макет с media queries, flexbox и другие техники." 
        },
        "personal-portfolio-webpage": {
            "description" : "В финальном проекте использовались все полученные на курсе знания. Для создания личного портфолио использовались панель навигации, изображения, внутренние и внешние ссылки. Для адаптивности использовались такие свойства, как media querу и viewport height."
        },
        "certificate": {
            "description": "Сертификат полученный после выполнения всех 5 обязательных проектов, и подтверждающий базовые знания HTML и CSS для веб-разработки."
        }
    },
    "js": {
        "description": "Простые проекты, созданные для курса FreeCodeCamp по алгоритмам и структурам данных на JavaScript (JavaScript Algorithms and Data Structures) в 2024 году",
        "palindrome-checker": {
            "description": "Приложение, проверяющее является ли введенное слово палиндромом, т.е. читается ли оно одинаково слева направо и справа налево, игнорируя знаки препинания, заглавные буквы и пробелы." 
        },
        "roman-numeral-converter": {
            "description": "Приложение преобразующее арабские цифры (1-3999) в римские в соответствующем формате (IV, IX, XL, XC, CD, CM)."
        },
        "telephone-number-validator": {
            "description": "Приложение, проверяющее является ли телефонный номер действительным (формат US). Также включает необязательный код страны (US = 1) и проверку кода города."
        },
        "cash-register": {
            "description": "Программа рассчитывает сдачу на основе цены товара, предоставленных денежных средств и текущего остатка в кассе. Обрабатывает три возможных статуса кассы: OPEN (открыто), CLOSED (закрыто) и INSUFFICIENT FUNDS (недостаточно средств)."
        },
        "RPG-creature-search-app": {
            "description": "Приложение для поиска существ в RPG игре. Получает данные о покемонах из API freeCodeCamp RPG-существ  по имени или ID и отображает статистику, типы и характеристики."
        },
        "certificate": {
            "description": "Сертификат получен после завершения всех 5 проектов, подтверждающий владение основами JavaScript и умением применять их для решения проблем."
        }
    },
    "libraries": {
        "description": "Простые проекты, созданные для курса FreeCodeCamp Фронтенд-библиотеки (Front-End Libraries) в первой половине 2025 года",
        "random-quote-machine": {
            "description": "Генератор случайных цитат. Получает случайную цитату из API и отображает её на странице, меняя фон. Цитатой можно поделиться в Twitter (X)." 
        },
        "markdown-previewer": {
            "description": "Редактор Markdown. Позволяет писать текст в формате Markdown и в реальном времени видеть результат в HTML." 
        },
        "drum-machine": {
            "description": "Симулятор электронной барабанной установки. Позволяет воспроизводить два набора по девять звуков, включать/выключать питание и регулировать громкость." 
        },
        "js-calculator": {
            "description": "Калькулятор на JavaScript. Позволяет пользователям выполнять простые арифметические вычисления."
        },
        "25-5": {
            "description": "Таймер 25 + 5 (метод Помодоро). Позволяет устанавливать рабочие интервалы и перерывы; запускать, ставить на паузу и сбрасывать таймер; получать визуальные и звуковые оповещения по окончании времени." 
        },
        "certificate": {
            "description": "Сертификат получен после завершения всех 5 проектов с использованием фронтенд-библиотек. Для прохождения требовалось воспользоваться библиотеками, которые изучаются на курсах freeCodeCamp (Bootstrap, jQuery, SASS, Redux, React). Моё предпочтение для всех проектов было отдано React 18."
        }
    }
}