{
    "facts-game": {
        "the-anime-name": {
            "description": "かつて日本人の男性に、私の短い名前はアニメのキャラクターの名前に似ていると言われ、ただのオタクっぽいニックネームだと思われました。私は動じず、子供の頃から母でさえそう呼んでいると冷静に説明しました。それが私が (e)L である由来です。よろしくお願いします！",
            "achievement": "公式設定"
        } ,
        "the-walking-dictionary": {
            "description": "大学時代、私はとても几帳面な学生でした。翻訳の実践授業では、いつも言葉の最も適切で面白い意味を深掘りしていました。もちろん、グループのメンバーはこれにイライラすることも多く、私のことを『歩く辞書』と呼び始めました。なんてオタクなんだ！",
            "achievement": "辞書マスター"
        },
        "the-tumblr-beginning": {
            "description": "中学生の時にTumblrを見つけました。そこには「ブログをデザイン」する機能、つまりフルのHTMLエディターがありました。当時はコーディングについて何も知りませんでしたが、オープンソースのテーマコードを見つけて編集し、カスタムカーソルなどの機能を追加していました！これがウェブデザインについて初めて考えたきっかけで、とても楽しかったです。",
            "achievement": "WEB恐竜"
        },
        "the-fateful-advice": {
            "description": "プロのゲームローカライゼーションコースを受講中に、最終的にフロントエンド開発者になろうと決心しました。CATツールの知識を深めるだけだと思っていましたが、講師がドキュメント内での使い方をよりよく理解するためにHTMLコースを受講するよう勧めました。その通りにしたら…こうしてここにいます。コーディングの深淵に吸い込まれて、そしてそれが大好きです！",
            "achievement": "始まりの物語"
        },
        "the-diverted-path": {
            "description": "もともとはコンピューターサイエンスを専攻したかったんです。ロシアでは最終試験（統一国家試験）の科目を事前に選択する必要があります。情報の先生が、前の先生がしっかり教えておらず、私たちが失敗したら自分が罰せられるからという理由で、私が試験を受けるのを許可しないと直接言いました。内気な子供だった私は抗議できませんでした（今なら自分で立ち向かうべきだったとわかりますが）。結局、代わりに英語と歴史の試験を受け、翻訳学を専攻することになりました。（でも、最終的には最初の計画に戻れました！）",
            "achievement": "展開に注目"
        },
        
        "the-proactive-kid": {
            "description": "子供の頃はとても積極的でした！母が私をダンス、英語、水泳などの課外活動に通わせてくれました！いつもほとんど急いでいましたが、それでもすべての宿題を終わらせ、良い生徒でいることができました。ただ、水泳で真に卓越できるほどもっと時間が欲しかったです！",
            "achievement" : "エナジーモード"
        },
        "the-language-environment": {
            "description": "子供の頃から外国語を耳にしてきました。母語はロシア語ですが、家族のほとんどはタタール語を話します。バシコルトスタンで育ち、学校でバシキール語を学びました。初めての英語の授業は5歳の時でした。5年生の時から日本語を学びたかったのですが、結局大学1年生の時に趣味として勉強を始めました、ラテン語の授業があったのと同じ年です。大学での主専攻語は英語で、副専攻はドイツ語でした。語学学習は大変ですが、いつかまた他にもたくさん学びたい言語があります。",
            "achievement": "多言語マスター"
        },
        "learning-english-through-music": {
            "description": "ロシア語（母語）の音楽を聴くのはいつも少し気まずく感じ、10代の頃から英語の音楽を好んでいました。これは英語の上達に大きく役立ちました。歌詞をノートに書き写して分析し、一緒に歌ったこともあります。これは言語学習のモティベーションに悩む人に常にお勧めしていることです：夢中になれるものを見つけ、楽しみながら学ばせてください。現在、私は日本の音楽に夢中です！",
            "achievement": "歌詞マニア"
        },
        "the-passionate-linguist": {
            "description": "新しい人に会うと、会話はよく、私がランダムな言語学の豆知識（特に語源について！）を共有したり、基本的なローカライゼーションの仕組みを説明したり、「新語は言語を汚す」と主張する人々に熱く議論したりすることになってしまいます…その話題の最終論文を読ませてください、Google Ngramsとマスメディアのリソースを使いましたよ！覚えておいてください、言語は生きている構造体です；常に新しい語彙を取り入れ、現代のニーズに適応するのです。以上。",
            "achievement": "ラスボス"
        },
        "the-nlp-revelation": {
            "description": "大学ではNLP（自然言語処理）の授業がありました。これは言語学と数学、コーディングを結びつける分野で、現在AIに広く利用されています。CATツールやn-gramからVPNの仕組みまで、あらゆることを議論しました。3年次には、Pythonを使って大規模な文献データベースを検索するためのドキュメントとして本を使用する課題が出ました。コーディング経験ゼロの翻訳専攻の学生として、私たちは仰天し、完全に恐怖を感じました。当時は悪夢のように感じましたが、今ではタスクの核心的な概念を理解しています；私たちはただただ準備不足だったのです。",
            "achievement": "続・始まりの物語"
        },
        "face-reveal": {
            "description": "",
            "achievement": "開発者に会った"
        }
    },
    "game-section":{
        "congrats": "おめでとうございます!",
        "hi": "はじめまして！私はエリナ（エル）です！\nよろしくお願いします！",
        "again": "もう一回",
        "achievement-unlocked": "実績解除",
        "start": "スタート",
        "pull": "一回引く"
    }
}
